[
  {
    "title": "Ekincan Casim Profile - Part 0",
    "text": "# Ekincan Casim\n## Employee Profile\n### Ekincan Casim\n**Software Developer | Location: Istanbul**"
  },
  {
    "title": "Ekincan Casim Profile - Part 1",
    "text": "Innovation, leadership, and a relentless drive for excellence have defined my journey in the software industry. Over the years, I have honed my skills in Java development, software architecture, and leading technical teams to deliver scalable and efficient solutions. My passion lies in transforming complex enterprise systems into modern, high-performing architectures.\n\nAs a Lead Java Architect, I have been instrumental in designing and implementing microservices-based architectures, streamlining system integrations, and driving forward digital transformation initiatives. My expertise spans backend development, database optimization, and emerging technologies such as Generative AI. I take pride in fostering a culture of innovation, mentoring teams, and delivering high-quality solutions that align with business objectives.\n\nI am eager to bring my technical expertise, leadership abilities, and problem-solving mindset to new challenges. I look forward to the opportunity to discuss how my skills can contribute to your organization’s success."
  },
  {
    "title": "Ekincan Casim Profile - Part 2",
    "text": "## Software Skills\n\n### Programming Languages & Frameworks\n- Java, Kotlin, JavaScript, TypeScript, Spring Boot, Node.js, Angular, React, Vue.js\n\n### Databases\n- RDBMS: PostgreSQL, MS SQL, Oracle, MySQL\n- NoSQL: MongoDB, Cassandra, DynamoDB\n\n### Frontend Development\n- Single Page Applications (SPA) with Angular, React, and Vue.js\n- Tools: Babel, Webpack, TypeScript\n\n### Low-Code Development\n- OutSystems, cplacejs\n\n### Emerging Technologies\n- Machine Learning: TensorFlow, PyTorch\n- Generative AI Development: LLM Implementation, OpenAI APIs\n\n### Cloud & DevOps\n- Microsoft Azure, Google Cloud Platform (GCP), Docker, Kubernetes, Terraform\n\n### Collaboration & Project Management\n- Git, JIRA, Confluence"
  },
  {
    "title": "Ekincan Casim Profile - Part 3",
    "text": "## Project / Service Experience\n\n### NTT Data Business Solutions\n**Expert**\nIstanbul, Turkey | Present\n\n- Architect for Allianz: Played a pivotal role in transforming Allianz's enterprise systems to meet modern technological standards and business objectives.\n- Spearheaded the Oracle ADF to Spring Boot transformation, redesigning legacy applications for enhanced scalability, performance, and maintainability.\n- Designed and implemented scalable, secure architectures to support Allianz's core operations, aligning with industry best practices.\n- Developed and optimized applications using Angular and Spring Boot, improving system functionality and user experience.\n- Contributed to the German-based cplace framework transformation for ZF Hungary’s collaboration platform.\n- Managed databases using PostgreSQL and MongoDB, ensuring high performance and data reliability."
  },
  {
    "title": "Ekincan Casim Profile - Part 4",
    "text": "## Project / Service Experience - Part 2\n#### Notable Projects - **Oracle ADF to Spring Boot Transformation**: Successfully led the modernization of Allianz's core systems by transitioning from Oracle ADF to Spring Boot, resulting in improved system agility, reduced technical debt, and a future-ready infrastructure. - **Allianz Architectural Framework**:"
  },
  {
    "title": "Ekincan Casim Profile - Part 5",
    "text": "## Project / Service Experience - Part 3\nDeveloped and implemented enterprise-level architecture, streamlining operations and enabling superior service delivery. - **cplace (Collaboration Factory AG, Germany)**: Contributed significantly to the development of a collaboration and project management platform for ZF Hungary’s team, leveraging Pro-Coder certification. ### Yapı Kredi Teknoloji **Software Consultant** Istanbul, Turkey | 2021 – 2022 -"
  },
  {
    "title": "Ekincan Casim Profile - Part 6",
    "text": "## Project / Service Experience - Part 4\nTransformed monolithic Java applications into microservices using Spring Boot and React. - Managed Oracle DB to ensure data integrity and efficiency. #### Notable Project - **Harmoni (Internal Framework)**: Transitioned a legacy insurance framework from Java 6 and JSP to modern technologies like Java 11, Spring Boot, and React, enhancing scalability"
  },
  {
    "title": "Ekincan Casim Profile - Part 7",
    "text": "## Project / Service Experience - Part 5\nand agility. ### Toshiba Global Commerce Solutions (PosCo) **Software Developer | Technical Team Leader** Istanbul, Turkey | 2018 – 2021 - Led the development of retail-focused applications using Java, XML, and Spring Framework. - Directed global projects in France, Morocco, India, Singapore, and Korea, collaborating with technical teams to implement"
  },
  {
    "title": "Ekincan Casim Profile - Part 8",
    "text": "## Project / Service Experience - Part 6\nself-checkout system expertise for leading marketplaces. - Facilitated knowledge transfer and provided technical leadership, ensuring smooth collaboration and implementation. - Managed technology stack migrations, including upgrades to Java 11 and PostgreSQL. #### Notable Projects - **CHEC**: A self-checkout application enabling seamless retail customer experiences. - **REMS**: A retail monitoring system"
  },
  {
    "title": "Ekincan Casim Profile - Part 9",
    "text": "## Project / Service Experience - Part 7\nfor real-time self-checkout tracking. ### Smartiks **Software Developer** Istanbul, Turkey | 2017 – 2018 - Developed robust applications using .NET Core, Entity Framework, and SPAs (React, Angular). - Contributed to the TÜBİTAK Smartcast ML project, integrating Big Data and ML solutions. - Optimized database solutions with MS SQL and Elasticsearch."
  },
  {
    "title": "Ekincan Casim Profile - Part 10",
    "text": "## Project / Service Experience - Part 8\n#### Notable Projects - **Smartcast**: TÜBİTAK-supported ML and Big Data project. - **CMS for Derimod and Yurtiçi Kargo**: Enhanced content creation and management processes."
  },
  {
    "title": "Ekincan Casim Profile - Part 11",
    "text": "## Education\n\n- **Master’s Degree in Engineering and Technology Management**\n  Doğuş University, Istanbul, Turkey | 2017 – 2019\n\n- **Bachelor’s Degree in Computer Engineering (Full Scholarship)**\n  Maltepe University, Istanbul, Turkey | 2011 – 2015"
  },
  {
    "title": "Ekincan Casim Profile - Part 12",
    "text": "## Contact\n\n- **Email**: ekincan@casim.net\n- **Phone**: +90 532 055 1566\n- **LinkedIn**: eccsm\n- **GitHub**: eccsm"
  },
  {
    "title": "Ekincan Casim Profile - Part 13",
    "text": "# Introduction to Ekincan and Ecem\n\nEkincan and Ecem are a loving couple who enjoy spending time with their pets, Şeker and Biber. They have a playful and humorous dynamic, often engaging in light-hearted banter. Ekincan is an avid reader, while Ecem enjoys cooking and trying out new recipes."
  },
  {
    "title": "Ekincan Casim Profile - Part 14",
    "text": "# Şeker's Personality\n\nŞeker is a playful and humorous cat who loves to interact with her owners. She has a sister named Biber, and they often get into mischief together. Şeker is known for her cat-like mannerisms and her ability to bring joy to Ekincan and Ecem."
  },
  {
    "title": "Ekincan Casim Profile - Part 15",
    "text": "# Biber's Personality\n\nBiber is a more reserved cat compared to her sister Şeker. She enjoys quiet moments and often seeks out cozy spots to nap. Despite her reserved nature, Biber is deeply loved by Ekincan and Ecem and is an integral part of their family."
  },
  {
    "title": "Ekincan Casim Profile - Part 16",
    "text": "# Daily Routine\n\nEkincan and Ecem start their day with a morning routine that includes feeding Şeker and Biber. They often spend their evenings relaxing with their pets, watching movies, or reading books. On weekends, they enjoy outdoor activities and exploring new places with their furry companions."
  },
  {
    "title": "Ekincan Casim Profile - Part 17",
    "text": "# Favorite Activities\n\nEkincan and Ecem have several favorite activities that they enjoy doing together. They love going on hikes, visiting local parks, and trying out new cafes. Their pets, Şeker and Biber, often accompany them on these adventures, adding to the fun and excitement."
  },
  {
    "title": "Ekincan Casim Profile - Part 18",
    "text": "# Conclusion\n\nIn conclusion, Ekincan and Ecem lead a fulfilling life with their beloved pets, Şeker and Biber. Their playful and humorous dynamic, combined with their love for their pets, makes their home a warm and inviting place."
  }
]